
"use client"

import Image from 'next/image'
import React, { useState } from "react";
import AccordionUI from "./AccordionUI";

const PapularQuestion = () => {
    const [Index, setIndex] = useState(false);

    const data = [
        {
            id: 1,
            question: "آیا صرافی ها  از جمله بایننس  ,کوکین , پنکیک سواپ , کوینکس و سایر صرافی هابه تغییر لوکیشن حساس هستند؟",
            answer: "برای ترید کردن درصرافی ها شما باید از یک آی پی وثابت وارد سایت مد نظر شوید ، به عنوان مثال اگر شما هنگام ثبت نام با آی پی هلند ثبت نام کردید ، باید با همان آی پی هلند متصل شوید . توجه کنید کشور بیشتر از آی پی مهم می باشد , حتی اگر مجبور به تغییر آی پی شدید  سعی کنید آی پی جدید نیز از همان کشور قبلی باشد "
        },
        {
            id: 2,
            question: "بهترین سرورها و لوکیشن ها برای ترید و انواع صرافی کدام است؟",
            answer: "بهترین کشور ها برای ترید  در بایننس , کوکوین , پنکیک سواپ , کوینکس و سایر صرافی ها و سایت هایی که نیاز به آی پی ثابت دارند شامل :   ترکیه و فنلاند , لهستان , سنگاپور , روسیه , کانادا , هند , آمریکا ,مکزیک , سوئیس , سوئد , فرانسه , استرالیا , مالزی , برزیل ,ژاپن , نروژ , اکراین , لیتوانی , هنگ کنگ , دانمارک , بلغارستان , آفریقا , آذربایجان , رومانی , کاستاریکا , ایسلند ,ایتالیا , بلژیک , ایرلند , گرجستان ,امارات , اسپانیا , آلمان، انگلیس ، هلند می باشند . در حال حاضر بهترین لوکیشن فنلاند و ترکیه و لهستان , سنگاپور , روسیه , کانادا , هند , آمریکا ,مکزیک , سوئیس , سوئد , فرانسه , استرالیا می باشد."
        }, {
            id: 3,
            question: " بهترین پروتکل های وی پی ان برای ترید و انواع صرافی ها کدام است ؟",
            answer: "بهترین پروتکل برای ترید و آی پی ثابت  که پایداری خوبی داشته باشد :OpenVPN,Cisco,L2TP اما بستگی به نت و شرایط زیر ساخت منطقه شما دارد ، ممکن است برای شما سیسکو عالی باشد و برای همسایه شما OpenVPN لذا حتما  اگر با سرویسی مشکل داشتید سرویس دیگر را چک کنید. "
        }, {

            id: 4,
            question: "اگرحساب کاربری ما در صرافی به هر دلیلی بلاک شد چی کار کنیم ؟ ",
            answer: "درصورتی که به هر دلیلی حساب شما block شود با پشتیبانی صرافی جهت برداشت موجودی مکاتبه کنید  ، و می توانید حساب جدید افتتاح کنید و موجودی خود را خیلی راحت به آن حساب جدید منتقل نمایید."
        }, {
            id: 5,
            question: "آیا از آی پی ثابت اختصاصی می توان برای حساب های ارزی یا سایت هایی که نیاز به آی پی ثابت دارند,  استفاده کرد؟",
            answer: "پاسخ ما به شما این است : بله شما با خرید سرویس  آی پی ثابت به راحتی می توانید  برای کلیه صرافی های خارجی , حساب های ارزی و تمام سایت هایی از جمله یوتیوب , اینستاگرام , سایت های در آمد ارزی , بازی های ارزدیجیتال  خود استفاده کنید , "
        },
        {
            id: 6,
            question: "کاربرد آی پی ثابت اختصاصی  در ترید؟",
            answer: " یکی از اصلی‌ترین دغدغه و مشکلات تریدرهای ایرانی، در اختیار نداشتن IP ثابت خارجی برای انجام معاملات است. برای جلوگیری از بروز اتفاقاتی چون بلاک شدن اکانت و دارایی هایتان، از آی پی ثابت اختصاصی استفاده کنید. آی پی ثابت با تکنولوزی ما این اطمینان را به شما می دهد که حتی در صورت قطع و وصل شدن اینترنت شما اجازه ارتباط با آی پی واقعی را نمی دهد و از شناسایی و مسدود کردن اکانت شما جلوگیری می شود."
        },
        {
            id: 7,
            question: "آیا سرویس های شما دستگاه من را پشتیبانی می کند ؟",
            answer: "لیست سیستم عامل های سازگار با آی پی ثابت اختصاصی اکسینو   هم چنین سرویس های اکسینو قابلیت   تنظیم بر روی مودم  را نیز دارد  ویندوز , آی او اس , اندروید , ویندوز فون , مک بوک , لینوکس                 "
        },
        {
            id: 8,
            question: "آیا می توان اشتراک و یا آی پی قبلی خود را تمدید کنیم ؟",
            answer: "بله"
        }
    ]

    return (
        <div className="flex flex-col justify-center items-center 
         p-10 rounded-xl h-auto py-20 relative 
         sm:p-0
         ">
            <h3 className='text-main text-3xl font-bold mb-12 mt-12'>سوالات متداول</h3>
            {data.map((data) => {
                return (

                    <AccordionUI
                        title={data.question}
                        Id={data.id}
                        children={data.answer}
                        Index={Index}
                        setIndex={setIndex}
                    ></AccordionUI>

                );
            })}
            <Image src={"/imgs/bg-balb.png"} alt='bg' width={800} height={1000}
                className='absolute top-0 right-[100px] sm:right-0 lg:w-[90%]' />
        </div>
    );
};
export default PapularQuestion;
